In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("Social_Network_Ads.csv")

In [3]:
data

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [5]:
data=pd.get_dummies(data,drop_first=True)
data

      User ID  Age  EstimatedSalary  Purchased  Gender_Male
0    15624510   19            19000          0            1
1    15810944   35            20000          0            1
2    15668575   26            43000          0            0
3    15603246   27            57000          0            0
4    15804002   19            76000          0            1
..        ...  ...              ...        ...          ...
395  15691863   46            41000          1            0
396  15706071   51            23000          1            1
397  15654296   50            20000          1            0
398  15755018   36            33000          0            1
399  15594041   49            36000          1            0

[400 rows x 5 columns]

In [6]:
data.columns

Index(['User ID', 'Age', 'EstimatedSalary', 'Purchased', 'Gender_Male'], dtype='object')

In [7]:
independent=data[['User ID', 'Age', 'EstimatedSalary', 'Gender_Male']]
dependent=data[[ 'Purchased']]

In [8]:
independent.shape

(400, 4)

In [9]:
data["Purchased"].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

In [10]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(independent,dependent,test_size=0.30,random_state=0)

In [11]:
from sklearn.tree import DecisionTreeClassifier
classifier=DecisionTreeClassifier()
classifier.fit(x_train,y_train)

DecisionTreeClassifier()

In [12]:
ypred=classifier.predict(x_test)

In [14]:
from sklearn.metrics import confusion_matrix
cm=confusion_matrix(y_test,ypred)

In [15]:
from sklearn.metrics import classification_report
class_report=classification_report(y_test,ypred)

In [16]:
cm

array([[69, 10],
       [ 7, 34]], dtype=int64)

In [17]:
print(class_report)

              precision    recall  f1-score   support

           0       0.91      0.87      0.89        79
           1       0.77      0.83      0.80        41

    accuracy                           0.86       120
   macro avg       0.84      0.85      0.85       120
weighted avg       0.86      0.86      0.86       120